package org.ywb.rpc.protocol.support;

import lombok.Data;

/**
 * @author yuwenbo1
 * @date 2021/2/16 1:33 下午 星期二
 * @since 1.0.0
 * 传输协议内容
 * +---------------------------------------------------------------+
 * | 魔数 2byte | 协议版本号 1byte | 序列化算法 1byte | 报文类型 1byte  |
 * +---------------------------------------------------------------+
 * | 状态 1byte |        消息 ID 8byte     |      数据长度 4byte     |
 * +---------------------------------------------------------------+
 * |                    数据内容(长度不定)                           |
 * +---------------------------------------------------------------+
 */
@Data
public class NettyRpcProtocol<T> {
    /**
     * 消息头
     */
    private MsgHeader msgHeader;
    /**
     * 消息体
     */
    private T body;
}
